app/controllers/messages_controller.rb

  def index
    respond_with Message.find_or_create_default
---
INSERT INTO `messages` (`content`, `created_at`, `updated_at`) VALUES (NULL, '2012-10-09 13:53:07', '2012-10-09 13:53:07')
SELECT `messages`.* FROM `messages`

  def update
    message = Message.find(params[:id])
    message.update_attributes(params[:message])
---
SELECT `messages`.* FROM `messages` WHERE `messages`.`id` = 1 LIMIT 1
UPDATE `messages` SET `content` = 'adf', `updated_at` = '2012-10-09 19:25:51' WHERE `messages`.`id` = 1